console.log('number' + 3 + 3);
// output: number33
// перша дія складання 'number' + 3 - javascript визнає 'number' як строку а + к строці це об'єднання строк.
// то 3 як намбер перетворюється в строку
// друга дія: до результату першої дії, яка вийшла строкою number3 додається 3 , який також додається як строка.

console.log( null + 3);
//output: 3
// null - вказує пусте значення і якщо до пустоти додати 3, то буде 3


console.log(5 && "qwerty");
//output: qwerty
// виводиться відповідь виходячі з послідовності логічної операції

console.log(+'40' + +'2' + "hillel");
//output: 42hillel
// спочатку дані 40 і 2 приводяться до числа і складаються як математичний приклад,
// і до результату додається hillel, як строка

console.log('10' - 5 === 6);
//output: false
// спочатку виконується математична операція де є результат 5, а потім операція порівняння строгої рівності

console.log(true + false);
// output: 1
// рахується як математичний вираз 1+0

