console.log('number' + 3 + 3);
// output: number33
// перша дія складання 'number' + 3 - javascript визнає 'number' як строку а + к строці це об'єднання строк.
// то 3 як намбер перетворюється в строку
// друга дія: до результату першої дії, яка вийшла строкою number3 додається 3 , який також додається як строка.

console.log( null + 3);
//output: 3
// null - вказує пусте значення і якщо до пустоти додати 3, то буде 3


console.log(5 && "qwerty");
//output: qwerty
// виводиться відповідь виходячі з послідовності логічної операції

console.log(+'40' + +'2' + "hillel");
//output: 42hillel
// спочатку дані 40 і 2 приводяться до числа і складаються як математичний приклад,
// і до результату додається hillel, як строка

console.log('10' - 5 === 6);
//output: false
// спочатку виконується математична операція де є результат 5, а потім операція порівняння строгої рівності

console.log(true + false);
// output: 1
// рахується як математичний вираз 1+0

console.log('4px' - 3)
//output: Nan
// маємо перше значення строку, а зі строкою не може буде операції віднімання

console.log('4' - 3);
//output: 1
// виконується операція віднімання

console.log('6' + 3 ** 0);
//output: 61
//виконується спочатку операція зведення в ступінь і результатом є 1,
// потім додається значення строки

console.log(2 / '6');
//output: 2
// виконується операція ділення з однією дією

console.log('10' + (5 === 6));
//output: 10false
// спочатку виконується операція порівняння строгої рівності і отримуємо булін результат false,
// який приєднується до значення строки '10'

console.log(null == '');
//output: false
// не виконуєтьс рівністьб бо пуста строка не може бути Null

console.log(3 ** (9 / 3));
// output: 27
//cпочатку виконується перша дія у дужкахб а потім зведення у ступінь

console.log(!!'false' == !!'true');
// output: true
// тому що !! дають значення тру

console.log(0 || '0' && 1)
// output: 1
// відбувається послідовне виконання логічних операцій

console.log((+null == false) < 1);
//output:false
//спочатку порівняння у дужках і у результаті отримуємо true, далі виконуємо рівність true<1, що є невірно